<!DOCTYPE html>
<!--[if lt IE 9]><html class="no-js lt-ie9" lang="fr" dir="ltr"><![endif]--><!--[if gt IE 8]><!-->
<html class="no-js" lang="fr" dir="ltr">
<!--<![endif]-->
<head>
<meta charset="utf-8">
<!-- Web Experience Toolkit (WET) / Boîte &agrave; outils de l'exp&eacute;rience Web (BOEW)
wet-boew.github.io/wet-boew/License-en.html / wet-boew.github.io/wet-boew/Licence-fr.html -->
<title>Nouvelle mise en page des textes l&eacute;gislatifs</title>
<meta content="width=device-width,initial-scale=1" name="viewport">
<!-- Meta data -->
<meta name="description" content="Lois codifi&eacute;es R&egrave;glements codifi&eacute;s">
<meta name="dcterms.title" content="Lois codifi&eacute;es R&egrave;glements codifi&eacute;s">
<meta name="dcterms.creator" content="Minist&egrave;re de la Justice">
<meta name="dcterms.issued" title="W3CDTF" content="2015-11-30">
<meta name="dcterms.modified" title="W3CDTF" content="2015-11-30">
<meta name="dcterms.subject" title="scheme" content="Lois codifi&eacute;es R&egrave;glements codifi&eacute;s">
<meta name="dcterms.language" title="ISO639-2" content="fra">
<meta property="dcterms:accessRights" content="2"/>
<meta property="dcterms:service" content="JUS-Laws_Lois"/>

<!-- Meta data-->
<!--[if gte IE 9 | !IE ]><!-->
<link href="/theme-gcwu-fegc/assets/favicon.ico" rel="icon" type="image/x-icon">
<link rel="stylesheet" href="/theme-gcwu-fegc/css/theme.min.css">
<!--<![endif]-->
<!--[if lt IE 9]>
<link href="/theme-gcwu-fegc/assets/favicon.ico" rel="shortcut icon" />
<link rel="stylesheet" href="/theme-gcwu-fegc/css/ie8-theme.min.css" />
<script src="http://ajax.googleapis.com/ajax/libs/jquery/1.11.1/jquery.min.js"></script>
<script src="/wet-boew/js/ie8-wet-boew.min.js"></script>
<![endif]-->
<noscript><link rel="stylesheet" href="/wet-boew/css/noscript.min.css" /></noscript>
<link rel="stylesheet" type="text/css" href="/css/browse.css" />
<link rel="stylesheet" type="text/css" href="/css/commonView.css" />
<link rel="stylesheet" type="text/css" href="/css/lawContent.css" />
<script src="//assets.adobedtm.com/be5dfd287373/bb72b7edd313/launch-e34f760eaec8.min.js"></script>
</head>

<body vocab="http://schema.org/" typeof="WebPage">
<ul id="wb-tphp">
<li class="wb-slc">
<a class="wb-sl" href="#wb-cont">Passer au contenu principal</a>
</li>
<li class="wb-slc visible-sm visible-md visible-lg">
<a class="wb-sl" href="#wb-info">Passer &agrave; «&#160;&agrave; propos de ce site&#160;»</a>
</li>
<li class="wb-slc visible-md visible-lg">
<a class="wb-sl" href="#wb-sec">Passer au menu de la section</a>
</li>
</ul>
<header role="banner">
<!--#include virtual="/includes/banner-f.inc" -->
<!-- START BREADCRUMB -->
<nav role="navigation" id="wb-bc" property="breadcrumb">
<h2>Vous êtes ici :</h2>
<div class="container">
<div class="row">
<ol class="breadcrumb">
<li><a href="http://www.justice.gc.ca/fra">Accueil</a></li>
<li><a href="/fra">Site Web de la l&eacute;gislation accueil</a></li>
<li>>Nouvelle mise en page des textes l&eacute;gislatifs</li>
</ol>
</div>
</div>
</nav>
</header>
<!-- START MAIN CONTENT AREA -->
<div class="container">
<div class="row">
<main role="main" property="mainContentOfPage" class="col-md-9 col-md-push-3">
			<section>
			
<!-- CONTENT TITLE BEGINS | DEBUT DU TITRE DU CONTENU -->
<h1 class="IndexPage" id="wb-cont">Nouvelle mise en page des textes l&eacute;gislatifs</h1>

	<p>Dans le cadre des efforts continus d’am&eacute;lioration de l’acc&egrave;s &agrave; la justice pour les Canadiens, les versions imprim&eacute;es et PDF des lois et r&egrave;glements f&eacute;d&eacute;raux ont un nouvel aspect depuis janvier 2016. La nouvelle mise en page ne modifie pas l’&eacute;nonc&eacute; ni la signification des dispositions l&eacute;gislatives, mais elle est plus conviviale et facilite la lecture.</p>
	
	<h2>Quoi de neuf? </h2>
	<p>Globalement, la conception est plus moderne, plus nette, et la pr&eacute;sentation refl&egrave;te notamment les changements suivants :</p>
	<h3>Lignes plus longues</h3>
	<p>Les versions française et anglaise sont toujours côte &agrave; côte, mais les lignes de chaque colonne sont plus longues et plus espac&eacute;es. Grâce &agrave; ce changement, la mise en page du texte l&eacute;gislatif est conforme aux pratiques exemplaires actuelles dans la conception des documents.</p>
	<p>Afin d’allonger ces lignes, les notes apparaissant auparavant dans les marges de droite ou de gauche se retrouvent maintenant en caractères gras juste au-dessus de la disposition &agrave; laquelle elles se rattachent. Elles ne font pas partie du texte, n’y figurant qu’&agrave; titre de repère ou d’information.</p>
	<h3>Utilisation de polices de caract&egrave;res diff&eacute;rentes</h3>
	<p>Des styles et des tailles de polices de caract&egrave;res diff&eacute;rents sont utilis&eacute;s pour mettre en relief certains &eacute;l&eacute;ments et pour guider les yeux des lecteurs au long du texte. La structure du texte l&eacute;gislatif (en-têtes, articles, paragraphes, alin&eacute;as, etc.) a &eacute;t&eacute; mise en &eacute;vidence pour am&eacute;liorer la lisibilit&eacute;.</p>
	<p>Les titres et les sous-titres sont plus gros et plus visibles, ce qui aide les lecteurs &agrave; trouver l’information qu’ils cherchent. Leur police de caract&egrave;res sans empattements attire l’œil vers le corps du texte.</p>
	<p>Le recours &agrave; une police de caract&egrave;re &agrave; empattements pour la partie plus dense du corps du texte attire l’œil le long de chaque ligne et aide les lecteurs &agrave; distinguer les lettres de formes semblables.</p>
	<h3>Information en haut de page</h3>
	<p>Davantage d’information est maintenant affich&eacute;e dans l’en-tête pour orienter les lecteurs dans le texte. L’en-tête d’une page donn&eacute;e contient le titre du texte consult&eacute;, le titre des parties du texte, le cas &eacute;ch&eacute;ant, et les dispositions qui apparaissent sur cette page. </p>	
	<h2>Pourquoi ces changements?</h2>
	<p>La mise en page des textes l&eacute;gislatifs f&eacute;d&eacute;raux n’aurait  pas &eacute;t&eacute; modifi&eacute;e depuis 1969, soit depuis l’adoption de la <cite>Loi sur les langues officielles</cite>. Le gouvernement de l’&eacute;poque avait d&eacute;cid&eacute; que les versions anglaise et française de toutes les lois f&eacute;d&eacute;rales devaient être dispos&eacute;es côte &agrave; côte.</p>	
	<p>&Agrave; cette &eacute;poque, les machines &agrave; &eacute;crire et autres outils utilis&eacute;s pour formater des textes offraient beaucoup moins d’options en fait de styles et de tailles de polices, ce qui rendait difficile la mise en relief d’une partie sp&eacute;cifique d’un document. Comme la police employ&eacute;e &eacute;tait relativement petite, le document paraissait dense et encombr&eacute;. Cela rendait les lois plus difficiles &agrave; lire pour de nombreuses personnes, notamment les personnes ayant une d&eacute;ficience visuelle.</p>	
	<p>Depuis lors, on a beaucoup appris sur la façon dont la mise en page influence la lisibilit&eacute; des documents. Par ailleurs, la technologie informatique a facilit&eacute; l’application de ces connaissances &agrave; la conception de la mise en page.</p>	
	<p>Pour &eacute;laborer la nouvelle mise en page, les fonctionnaires du minist&egrave;re de la Justice se sont inspir&eacute;s des pratiques exemplaires et ont consult&eacute; des experts du domaine de la conception de documents afin que le r&eacute;sultat final soit aussi convivial que possible.  </p>	
	
</section>
<!--#include virtual="/includes/gcwu-date-mod-f.inc" -->
</main>
<!--#include virtual="/includes/secmenu_WET4-f.inc" -->
</div>
</div>
<!--#include virtual="/includes/footer_WET4-f.inc" -->
<!--[if gte IE 9 | !IE ]><!-->
<script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.4/jquery.js"></script>
<script src="/wet-boew/js/wet-boew.js"></script>
<!--<![endif]-->
<!--[if lt IE 9]>
<script src="/wet-boew/js/ie8-wet-boew2.js"></script>
<![endif]-->
<script src="/theme-gcwu-fegc/js/theme.js"></script>
</body>
</html>
