<!DOCTYPE html>
<!--[if lt IE 9]><html class="no-js lt-ie9" lang="fr" dir="ltr"><![endif]--><!--[if gt IE 8]><!-->
<html class="no-js" lang="fr" dir="ltr">
<!--<![endif]-->
<head>
<meta charset="utf-8">
<!-- Web Experience Toolkit (WET) / Boîte à outils de l'expérience Web (BOEW)
wet-boew.github.io/wet-boew/License-en.html / wet-boew.github.io/wet-boew/Licence-fr.html -->
<title>Aide &agrave; la recherche</title>
<meta content="width=device-width,initial-scale=1" name="viewport">
<!-- Meta data -->
<meta name="description" content="Lois codifi&eacute;es R&egrave;glements codifi&eacute;s">
<meta name="dcterms.title" content="Lois codifi&eacute;es R&egrave;glements codifi&eacute;s">
<meta name="dcterms.creator" content="Minist&egrave;re de la Justice">
<meta name="dcterms.issued" title="W3CDTF" content="2015-11-30">
<meta name="dcterms.modified" title="W3CDTF" content="2015-11-30">
<meta name="dcterms.subject" title="scheme" content="Lois codifi&eacute;es R&egrave;glements codifi&eacute;s">
<meta name="dcterms.language" title="ISO639-2" content="fra">
<meta property="dcterms:accessRights" content="2"/>
<meta property="dcterms:service" content="JUS-Laws_Lois"/>

<!-- Meta data-->
<!--[if gte IE 9 | !IE ]><!-->
<link href="/theme-gcwu-fegc/assets/favicon.ico" rel="icon" type="image/x-icon">
<link rel="stylesheet" href="/theme-gcwu-fegc/css/theme.min.css">
<!--<![endif]-->
<!--[if lt IE 9]>
<link href="/theme-gcwu-fegc/assets/favicon.ico" rel="shortcut icon" />
<link rel="stylesheet" href="/theme-gcwu-fegc/css/ie8-theme.min.css" />
<script src="http://ajax.googleapis.com/ajax/libs/jquery/1.11.1/jquery.min.js"></script>
<script src="/wet-boew/js/ie8-wet-boew.min.js"></script>
<![endif]-->
<noscript><link rel="stylesheet" href="/wet-boew/css/noscript.min.css" /></noscript>
<link rel="stylesheet" type="text/css" href="/css/browse.css" />
<link rel="stylesheet" type="text/css" href="/css/commonView.css" />
<link rel="stylesheet" type="text/css" href="/css/lawContent.css" />
<script src="//assets.adobedtm.com/be5dfd287373/bb72b7edd313/launch-e34f760eaec8.min.js"></script>
</head>

<body vocab="http://schema.org/" typeof="WebPage">
<ul id="wb-tphp">
<li class="wb-slc">
<a class="wb-sl" href="#wb-cont">Passer au contenu principal</a>
</li>
<li class="wb-slc visible-sm visible-md visible-lg">
<a class="wb-sl" href="#wb-info">Passer à «&#160;À propos de ce site&#160;»</a>
</li>
<li class="wb-slc visible-md visible-lg">
<a class="wb-sl" href="#wb-sec">Passer au menu de la section</a>
</li>
</ul>
<header role="banner">
<!--#include virtual="/includes/banner-f.inc" -->
<!-- START BREADCRUMB -->
<nav role="navigation" id="wb-bc" property="breadcrumb">
<h2>Vous êtes ici :</h2>
<div class="container">
<div class="row">
<ol class="breadcrumb">
<li><a href="http://www.justice.gc.ca/fra">Accueil</a></li>
<li><a href="/fra">Site Web de la législation accueil</a></li>
<li>Aide &agrave; la recherche</li>
</ol>
</div>
</div>
</nav>
</header>
<!-- START MAIN CONTENT AREA -->
<div class="container">
<div class="row">
<main role="main" property="mainContentOfPage" class="col-md-9 col-md-push-3">

			<section>
			
<h1 id="wb-cont">Aide &agrave; la recherche</h1>
	<div role="navigation">
<nav>
<ul class="linkList">
<li><a href="#Gen">G&eacute;n&eacute;ralit&eacute;s</a>
	<ul>
		<li><a href="#defaut">Comportement de recherche par d&eacute;faut</a></li>
		<li><a href="#metacaracteres">Les m&eacute;tacaract&egrave;res * et ?</a></li>
	</ul>
</li>
<li><a href="#Recherchebase">Recherche de base</a>
	<!--<ul>
		<li><a href="#champsBase">Champs de recherche</a></li>
	</ul> -->
</li>
<li><a href="#Rechercheavancee">Recherche avanc&eacute;e</a>
	<!-- <ul>
		<li><a href="#champsAv"  title="Champs de recherche (avanc&eacute;e)">Champs de recherche</a></li>
	</ul> -->
</li>
<li><a href="#resultats">R&eacute;sultats de recherche</a>
	<ul>
		<li><a href="#resContexte">R&eacute;sultats en contexte</a></li>
		<li><a href="#resSeulement">Titres seulement </a></li>
		<li><a href="#restreindre">Restreindre les r&eacute;sultats de recherche en utilisant les cat&eacute;gories disponibles</a></li>
	</ul>
</li>
</ul>
</nav>
</div>

		<div class="lineSeparator">
		</div>

<div class="wet-boew-texthighlight">


<h2 id="Gen">G&eacute;n&eacute;ralit&eacute;s</h2>
<p>Le Site Web de la l&eacute;gislation (Justice) a mis en place un moteur de recherche am&eacute;lior&eacute; qui offre une meilleure capacit&eacute; de recherche et des options pour en affiner les r&eacute;sultats.</p>
<p>Les conseils dans cette section vous aideront &agrave; obtenir des r&eacute;sultats plus pr&eacute;cis et vous aideront aussi &agrave; utiliser cet outil au maximum. </p>


<h3 id="defaut">Comportement de recherche par d&eacute;faut</h3>
<p>Lorsque vous entrez des mots s&eacute;par&eacute;s par des espaces, vous obtenez les documents qui renferment tous les mots demand&eacute;s. Plus vous entrez de mots et plus vous utilisez de champs, plus les r&eacute;sultats sont pr&eacute;cis. </p>
<p>Les documents trouv&eacute;s contiendront les occurrences exactes ainsi que des variantes de ces derni&egrave;res. Par exemple, si vous entrez le mot <em><span class="searchTerm">banque</span></em>, la recherche donnera <em><span class="searchTerm">banque</span></em> et <em><span class="searchTerm">banques</span></em>.</p>
<p>Noter que la zone de recherche ne fait pas la distinction entre les majuscules et les minuscules, ni entre les lettres avec accents (plus fr&eacute;quentes en français) et celles qui ne le sont pas. Donc, vous obtiendrez les mêmes r&eacute;sultats que vous tapiez  <em><span class="searchTerm">montreal</span></em>, <em><span class="searchTerm">Montreal</span></em>, <em><span class="searchTerm">MONTREAL</span></em>, <em><span class="searchTerm">montr&eacute;al</span></em> ou <em><span class="searchTerm">Montr&eacute;al</span></em>.</p>
<p>Le moteur de recherche ne tient pas compte des mots comme « et », « ou » et « par ». Par exemple, la recherche <em><span class="searchTerm">dans le temps</span></em> trouvera les parties contenant seulement le mot <em><span class="searchTerm">temps</span></em>. Toutefois, en s&eacute;lectionnant « cette expression exacte », dans Recherche avanc&eacute;e, vous obtiendrez des r&eacute;sultats avec les mots dont il n'a pas &eacute;t&eacute; pr&eacute;c&eacute;demment tenu compte.</p>

<h3 id="metacaracteres">Les m&eacute;tacaract&egrave;res * et ?</h3>

<p>Le m&eacute;tacaract&egrave;re * permet de rechercher les mots qui ont une racine ou un radical identique en remplaçant z&eacute;ro caract&egrave;re ou plus par un symbole. Par exemple, l'expression <em><span class="searchTerm">r&egrave;gle*</span></em> pr&eacute;sentera les parties qui contiennent <em><span class="searchTerm">r&egrave;gle, r&egrave;gles, r&eacute;gl&eacute;, r&eacute;gler, r&egrave;glement, r&egrave;glements, r&eacute;glementaire, r&eacute;glement&eacute;s, r&eacute;glementer</span></em>, etc.</p>

<p>Le m&eacute;tacaract&egrave;re ? permet de remplacer un seul caract&egrave;re dans une expression. Par exemple, l'expression <em><span class="searchTerm">r&egrave;gl??</span></em> pr&eacute;sentera les parties qui contiennent <em><span class="searchTerm">r&egrave;gles, r&eacute;gl&eacute;s, r&eacute;gler</span></em>, etc.</p>

<h2 id="Recherchebase">Recherche de base</h2>

<h3 id="champsBase">Champs de recherche</h3>

<p>Il y a trois champs de recherche disponibles dans Recherche de base : « Mot(s) cl&eacute;(s) », « Titre » et « Recherche dans ».</p>

<dl class="searchFieldLabels">
<dt>Mot(s) cl&eacute;(s) </dt>
<dd>– pr&eacute;sente les parties des documents (i.e, article, annexe ou titre) qui contiennent les mots-cl&eacute;s sp&eacute;cifi&eacute;s, sans qu'ils ne soient n&eacute;cessairement ensemble ou dans le même ordre. Ce champ offre des variantes grammaticales.</dd>
<dt>Titre  </dt>
<dd>– pr&eacute;sente les parties des documents qui contiennent les occurrences recherch&eacute;es dans leur titre. Des guillemets (" ") peuvent être ajout&eacute;s dans le but de trouver les occurrences exactes. Par exemple, une recherche dans <strong>Titre</strong> des mots <em><span class="searchTerm">agence du revenu</span></em> peut donner <em><span class="searchTerm">Agence des douanes et du revenu</span></em>, tandis que l'utilisation des guillemets (" ") vous donnera des r&eacute;sultats exacts. </dd>
<dt>Rechercher dans  </dt>
<dd>– permet de rechercher dans un document sp&eacute;cifique ou dans un groupe de documents.</dd>
</dl>

<h2 id="Rechercheavancee">Recherche avanc&eacute;e</h2>

<p>Le moteur Recherche avanc&eacute;e pr&eacute;sente plus d'options de recherche ainsi que la possibilit&eacute; de rechercher les versions ant&eacute;rieures des lois et r&egrave;glements codifi&eacute;s.</p>

<h3 id="champsAv">Champs de recherche</h3>

<dl class="searchFieldLabels">
<dt>tous ces mots  </dt>
<dd>– pr&eacute;sente les parties des documents (i.e, article, annexe et titre) qui contiennent tous les mots sp&eacute;cifi&eacute;s, sans qu'ils ne soient n&eacute;cessairement ensemble ou dans le même ordre. Ce champ offre des variantes grammaticales.</dd>
<dt>cette expression exacte  </dt>
<dd>– pr&eacute;sente les parties des documents qui contiennent l'expression exacte recherch&eacute;e. Ce champ n'offre pas de variantes grammaticales. Noter que les guillemets ne devraient pas être utilis&eacute;s dans ce champ.</dd>
<dt>un ou plusieurs de ces mots  </dt>
<dd>– pr&eacute;sente les parties des documents qui contiennent au moins une des occurrences recherch&eacute;es. Ce champ offre des variantes grammaticales.</dd>
<dt>aucun de ces mots </dt>
<dd>– restreint les r&eacute;sultats aux parties qui ne contiennent pas les mots sp&eacute;cifi&eacute;s. Ce champ offre des variantes grammaticales.</dd>
<dt>Titre </dt>
<dd>– pr&eacute;sente les parties des documents qui contiennent les occurrences recherch&eacute;es dans leur titre. Des guillemets (" ") peuvent être ajout&eacute;s afin de trouver les occurrences exactes. Par exemple, une recherche dans <strong>Titre</strong> des mots <em><span class="searchTerm">agence du revenu</span></em> peut donner <em><span class="searchTerm">Agence des douanes et du revenu</span></em>, tandis que l'utilisation des guillemets (" ") vous donnera des r&eacute;sultats exacts. </dd>
<dt>Loi habilitante  </dt>
<dd>– pr&eacute;sente les occurrences recherch&eacute;es dans les r&egrave;glements pris en vertu de la loi habilitante sp&eacute;cifi&eacute;e.</dd>
<dt>Chapitre / Num&eacute;ro d'enregistrement </dt>
<dd>- pr&eacute;sente, dans le num&eacute;ro de chapitre ou d'enregistrement, les parties des documents qui contiennent les occurrences recherch&eacute;es. </dd>
<dt>S&eacute;lectionner la date de la version ant&eacute;rieure  </dt>
<dd>– pr&eacute;sente les parties des documents qui contiennent les occurrences recherch&eacute;es et qui sont en vigueur &agrave; la date sp&eacute;cifi&eacute;e. Les donn&eacute;es des versions ant&eacute;rieures sont g&eacute;n&eacute;ralement disponibles &agrave; partir de 2003-01-01 pour les lois et &agrave; partir de 2006-03-22 pour les r&egrave;glements. Les donn&eacute;es des versions ant&eacute;rieures en ce qui concerne la Loi de l'impôt sur le revenu et le R&egrave;glement de l'impôt sur le revenu sont disponibles &agrave; partir de 2004-08-31.</dd>
<dt>Rechercher dans </dt>
<dd>– permet de rechercher dans un ou des groupes sp&eacute;cifiques. </dd>
</dl>

<h2 id="resultats">R&eacute;sultats de recherche </h2>


<p>Selon la s&eacute;lection choisie pour effectuer la recherche, les r&eacute;sultats s'affichent en <strong>titres seulement</strong> ou <strong>r&eacute;sultats en contexte</strong>. Vos r&eacute;sultats de recherche sont pr&eacute;sent&eacute;s par cat&eacute;gorie dans le côt&eacute; droit de l'&eacute;cran. Les cat&eacute;gories vous permettent de restreindre davantage votre recherche.</p>

<h3 id="resSeulement">S&eacute;lection choisie - Titres seulement </h3>
<p>Permet de trouver les titres, les num&eacute;ros de chapitre et d'enregistrement ainsi que les num&eacute;ros d'articles ou d'annexes des documents qui pr&eacute;sentent les occurrences recherch&eacute;es.  </p>

<p>Cliquer sur le lien de r&eacute;sultat (titre du document) pr&eacute;sentera la partie du texte contenant l'occurrence en surbrillance. Les &eacute;l&eacute;ments de textes qui ne contiennent pas les occurrences demand&eacute;es sont pr&eacute;sent&eacute;s sous le signe […]. Vous pouvez cliquer sur les liens <strong>R&eacute;sultat suivant</strong> et <strong>R&eacute;sultat pr&eacute;c&eacute;dent</strong> afin de vous d&eacute;placer d'un r&eacute;sultat &agrave; l'autre. Cliquer sur le lien <strong>Retourner &agrave; la liste des r&eacute;sultats</strong> vous am&egrave;nera au r&eacute;sultat initial. Dans cette s&eacute;lection choisie, cliquer dans le lien du document vous sortira de la page de recherche et vous am&egrave;nera aux textes contenant les occurrences surlign&eacute;es dans <a href="/fra/AideGenerale/index.html#viewDoc">Affichage du document</a>.</p>

<h3 id="resContexte">R&eacute;sultats en contexte</h3>

<p>Permet de trouver les titres, les num&eacute;ros de chapitre et d'enregistrement ainsi que les num&eacute;ros d'articles ou d'annexes des documents qui pr&eacute;sentent les occurrences recherch&eacute;es dont les termes sont soulign&eacute;s en surbrillance. Les &eacute;l&eacute;ments de textes qui ne contiennent pas les occurrences demand&eacute;es sont pr&eacute;sent&eacute;s sous le signe […]. Vous pouvez cliquer sur les liens <strong>Page de r&eacute;sultats suivante</strong> et <strong>Page de r&eacute;sultats pr&eacute;c&eacute;dente</strong> afin de vous d&eacute;placer d'un r&eacute;sultat &agrave; l'autre. Dans cette s&eacute;lection choisie, cliquer dans le lien du document vous sortira de la page de recherche et vous am&egrave;nera aux textes contenant les occurrences surlign&eacute;es dans <a href="/fra/AideGenerale/index.html#viewDoc">Affichage du document</a>. </p>

<h3 id="restreindre">Restreindre les r&eacute;sultats de recherche en utilisant les cat&eacute;gories disponibles</h3>

<p>Vos r&eacute;sultats de recherche seront pr&eacute;sent&eacute;s par cat&eacute;gorie, ce qui vous permet de restreindre davantage votre recherche.</p>
<p>Cliquez sur n'importe quel lien sous les entêtes des cat&eacute;gories pour voir les r&eacute;sultats de la recherche demand&eacute;e. Les nombres &agrave; côt&eacute; de chaque lien indiquent combien de r&eacute;sultats de la recherche originale font partie de cette cat&eacute;gorie.</p>
<p>Les cat&eacute;gories disponibles sont :</p>
<dl class="searchFieldLabels">
<dt>Type </dt>
<dd>– indique le type de document (i.e, lois, r&egrave;glements, documents constitutionnels)</dd>
<dt>Titre   </dt>
<dd>– indique le titre du document contenant les occurrences demand&eacute;es </dd>
<dt>Expressions connexes  </dt>
<dd>– selon vos crit&egrave;res de recherche, le moteur de recherche sugg&egrave;re une liste d'expressions connexes. Cette cat&eacute;gorie est seulement disponible dans Recherche avanc&eacute;e </dd>
</dl>


</div>
			
<!-- clf2-nsi2 theme ends / Fin du th&egrave;me clf2-nsi2 -->
			</section>
<!--#include virtual="/includes/gcwu-date-mod-f.inc" -->
</main>
<!--#include virtual="/includes/secmenu_WET4-f.inc" -->
</div>
</div>
<!--#include virtual="/includes/footer_WET4-f.inc" -->
<!--[if gte IE 9 | !IE ]><!-->
<script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.4/jquery.js"></script>
<script src="/wet-boew/js/wet-boew.js"></script>
<!--<![endif]-->
<!--[if lt IE 9]>
<script src="/wet-boew/js/ie8-wet-boew2.js"></script>
<![endif]-->
<script src="/theme-gcwu-fegc/js/theme.js"></script>
</body>
</html>
